# Intro to Pandas DataFrames

https://towardsdatascience.com/pandas-dataframe-a-lightweight-intro-680e3a212b96

In [7]:
my_dict = { 
     'name' : ["a", "b", "c", "d", "e","f", "g"],
     'age' : [20,27, 35, 55, 18, 21, 35],
     'designation': ["VP", "CEO", "CFO", "VP", "VP", "CEO", "MD"]
}

import pandas as pd
df = pd.DataFrame(my_dict)

In [9]:
df.head()

  name  age designation
0    a   20          VP
1    b   27         CEO
2    c   35         CFO
3    d   55          VP
4    e   18          VP

In [10]:
df.tail()

  name  age designation
2    c   35         CFO
3    d   55          VP
4    e   18          VP
5    f   21         CEO
6    g   35          MD